[MooseCheckCommandlet]
HelpDescription="Checks certain things in each package."
HelpUsage="gamename.exe MooseCheck <package.classname> [package.classname package.classname ...] [-switches...]"
HelpParamNames[0]="package.classname"
HelpParamDescriptions[0]="The full pathname for the class to search for, e.g. Engine.LightComponent"
HelpParamNames[1]="-ExactClass"
HelpParamDescriptions[1]="Indicates that only objects that have this class should be counted. Default behavior is to also count objects of derived classes of the specified class."
HelpParamNames[2]="-IncludeScript"
HelpParamDescriptions[2]="Indicates that packages which contain unrealscript (usually only .u packages) should be searched as well."
HelpParamNames[3]="-IncludeCooked"
HelpParamDescriptions[3]="Indicates that packages which have been cooked for a console platform should be searched as well."
HelpParamNames[4]="-CookedOnly"
HelpParamDescriptions[4]="Indicates that only those packages which have been cooked for a console platform should be searched."
HelpParamNames[5]="-SkipClientOnly"
HelpParamDescriptions[5]="Indicates that any objects which are only configured to load only on the client should be ignored."
HelpParamNames[6]="-SkipServerOnly"
HelpParamDescriptions[6]="Indicates that any objects which are only configured to load only on the server should be ignored."
HelpParamNames[7]="-SkipEditorOnly"
HelpParamDescriptions[7]="Indicates that any objects which are only configured to load only in the editor should be ignored."
HelpParamNames[8]="-IgnoreWriteable"
HelpParamDescriptions[8]="Indicates that only read-only packages should be checked (useful for avoiding old test packages which might crash the commandlet)"
HelpParamNames[9]="-IgnoreMaps"
HelpParamDescriptions[9]="Indicates that map pacakges should be skipped (speeds execution when the object you wish to list cannot be placed in maps)"
HelpParamNames[10]="-ObjectNames"
HelpParamDescriptions[10]="Displays the full path name for all objects found by the commandlet"
HelpParamNames[11]="-AllowNonVignettes"
HelpParamDescriptions[11]="Checks non vignette maps"
HelpParamNames[12]="-DontCheckDynamicLights"
HelpParamDescriptions[12]="Skip the check for dynamic lights"
